# BendingDetailTypeSegmentLengthsDisplayOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeSegmentLengthsDisplayOption Property
ParameterTypeId Class See Also
---
"Straight Segment Lengths"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeSegmentLengthsDisplayOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeSegmentLengthsDisplayOption As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeSegmentLengthsDisplayOption {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace